Revit 2027 API
DimensionSegment.ValueString Property
 The displayed value shown for the dimension segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ValueString { get; }
Public ReadOnly Property ValueString As String
	Get
public:
property String^ ValueString {
	String^ get ();
}
member ValueString : string with get
Property Value
String
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace